CFDEM/CFDEMcoupling/tutorials/cfdemSolverRhoPimple/ErgunTestMPI/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

r1	0.00976;
r2	0.01385;
h	0.0553;
nxy 8;
nz  24;
nr  4;

r1_	#calc "-$r1";
r2_	#calc "-$r2";
pi	#calc "Foam::constant::mathematical::pi";

vertices
(
    ( $r1 0.0 0.0 )
    ( $r2 0.0 0.0 )
	( 0.0 $r1 0.0 ) 
	( 0.0 $r2 0.0 ) 
    ( $r1_ 0.0 0.0 )
    ( $r2_ 0.0 0.0 )
	( 0.0 $r1_ 0.0 ) 
	( 0.0 $r2_ 0.0 )
    ( $r1 0.0 $h )
    ( $r2 0.0 $h )
	( 0.0 $r1 $h ) 
	( 0.0 $r2 $h ) 
    ( $r1_ 0.0 $h )
    ( $r2_ 0.0 $h )
	( 0.0 $r1_ $h ) 
	( 0.0 $r2_ $h )  
);

blocks
(
    hex (   0   1   3   2   8   9  11  10) (   $nr  $nxy  $nz) simpleGrading (1 1 1)
    hex (   2   3   5   4  10  11  13  12) (   $nr  $nxy  $nz) simpleGrading (1 1 1)
    hex (   4   5   7   6  12  13  15  14) (   $nr  $nxy  $nz) simpleGrading (1 1 1)
    hex (   6   7   1   0  14  15   9   8) (   $nr  $nxy  $nz) simpleGrading (1 1 1)
    hex (   0   2   4   6   8  10  12  14) (  $nxy  $nxy  $nz) simpleGrading (1 1 1)
);

edges
(
    arc    1   3 (  #calc "$r2*Foam::cos(($pi)/4.0)"  #calc "$r2*Foam::sin(($pi)/4.0)"   0.0)
    arc    3   5 (  #calc "-$r2*Foam::cos(($pi)/4.0)"  #calc "$r2*Foam::sin(($pi)/4.0)"   0.0)
    arc    5   7 (  #calc "-$r2*Foam::cos(($pi)/4.0)"  #calc "-$r2*Foam::sin(($pi)/4.0)"   0.0)
    arc    7   1 (  #calc "$r2*Foam::cos(($pi)/4.0)"  #calc "-$r2*Foam::sin(($pi)/4.0)"   0.0)
    arc    9   11 (  #calc "$r2*Foam::cos(($pi)/4.0)"  #calc "$r2*Foam::sin(($pi)/4.0)"   $h)
    arc    11   13 (  #calc "-$r2*Foam::cos(($pi)/4.0)"  #calc "$r2*Foam::sin(($pi)/4.0)"   $h)
    arc    13   15 (  #calc "-$r2*Foam::cos(($pi)/4.0)"  #calc "-$r2*Foam::sin(($pi)/4.0)"   $h)
    arc    15   9 (  #calc "$r2*Foam::cos(($pi)/4.0)"  #calc "-$r2*Foam::sin(($pi)/4.0)"   $h)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (   1   3  11   9)
            (   3   5  13  11)
            (   5   7  15  13)
            (   7   1   9  15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (   8   9  11  10)
            (  10  11  13  12)
            (  12  13  15  14)
            (  14  15   9   8)
            (   8  10  12  14)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (   0   2   3   1)
            (   2   4   5   3)
            (   4   6   7   5)
            (   6   0   1   7)
            (   0   6   4   2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
